package com.jeyjey.les4.tasks;

public class Task6 {

	public static void main(String[] args) {
		// 6. Написать программу, которая выводит на экран первые четыре степени числа
		// π.
		System.out.printf("%.4f", Math.PI);
	}

}
